# yolov8s_hyperace_ca_p2.yaml
nc: 1
depth_multiple: 0.33
width_multiple: 0.50

# 1. Backbone (保持不变，但标注好 P2 的位置)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (关键层)
  - [-1, 3, C2f, [128, True]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8-P5/32
  - [-1, 1, HyperACE_Module, [1024]] # 9-HyperACE 全局增强

# 2. Neck (增加 P2 上采样路径)
head:
  - [-1, 1, SPPF, [1024, 5]] # 10-P5/32
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-P4
  - [[-1, 6], 1, Concat, [1]] # 12-cat P4
  - [-1, 3, C2f, [512]] # 13-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14-P3
  - [[-1, 4], 1, Concat, [1]] # 15-cat P3
  - [-1, 3, C2f, [256]] # 16-P3 (原本的 P3 层)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17-P2 (新增上采样)
  - [[-1, 2], 1, Concat, [1]] # 18-cat P2 (与 Backbone 第 2 层融合)
  - [-1, 3, C2f, [128]] # 19-P2 (新增 P2 检测分支)
  - [-1, 1, CoordAtt, [128, 128]] # 20-CA位置增强

  - [-1, 1, Conv, [128, 3, 2]] # 21-P3
  - [[-1, 16], 1, Concat, [1]] # 22-cat P3
  - [-1, 3, C2f, [256]] # 23-P3

  - [-1, 1, Conv, [256, 3, 2]] # 24-P4
  - [[-1, 13], 1, Concat, [1]] # 25-cat P4
  - [-1, 3, C2f, [512]] # 26-P4
  - [-1, 1, CoordAtt, [512, 512]] # 27-CA位置增强

  - [-1, 1, Conv, [512, 3, 2]] # 28-P5
  - [[-1, 10], 1, Concat, [1]] # 29-cat P5
  - [-1, 3, C2f, [1024]] # 30-P5

  - [[19, 23, 26, 30], 1, OBB, [nc, 1, [64, 128, 256, 512]]] # 31-OBB (四个头：P2, P3, P4, P5)
