# 模型架构配置 (yolov8s_hyperace_ca.yaml)
# 融合 HyperACE 与 CoordAtt 模块的 YOLOv8s-OBB 自定义网络结构。

# 基本模型参数
nc: 1 # 类别数量
depth_multiple: 0.33 # 模型深度倍数
width_multiple: 0.50 # 层通道倍数

# YOLOv8.0s 骨干网络
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8

  # HyperACE 模块 (输出通道 512)
  - [-1, 1, HyperACE_Module, [512]]

  # Coordinate Attention 模块 (输出通道 512)
  # 进一步强化空间位置感知，特别是垂直方向的特征
  - [-1, 1, CoordAtt, [512]]

  # SPPF (索引顺延，连接上一层即第10层)
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]] # 13: cat backbone P4 (索引6不变，因为它在插入点之前)
  - [-1, 3, C2f, [512]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]] # 16: cat backbone P3 (索引4不变)
  - [-1, 3, C2f, [256]] # 17 (P3/8-small) -> 这是第一个输出层

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 14], 1, Concat, [1]] # 19: cat head P4 (原指向13，现指向14)
  - [-1, 3, C2f, [512]] # 20 (P4/16-medium) -> 这是第二个输出层

  - [-1, 1, Conv, [512, 3, 2]] # 21
  - [[-1, 11], 1, Concat, [1]] # 22: cat head P5 (原指向10 SPPF，现指向11)
  - [-1, 3, C2f, [1024]] # 23 (P5/32-large) -> 这是第三个输出层

  # OBB 检测头
  - [[17, 20, 23], 1, OBB, [nc, 1]]
